<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2020~
// +----------------------------------------------------------------------
// | 
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | gitee 开源项目：https://gitee.com/zoujingli/ThinkAdmin
// | github开源项目：https://github.com/zoujingli/ThinkAdmin
// +----------------------------------------------------------------------

return [
    // 数据库调试模式
    'debug'       => true,
    // 数据库类型
    'type'        => 'mysql',
    // 服务器地址
    'hostname'    => '127.0.0.1',
    // 数据库名
    'database'    => 'zjmj',
    // 用户名
    'username'    => 'root',
    // 密码
    'password'    => 'root',
    // 编码
    'charset'     => 'utf8mb4',
    // 端口
    'hostport'    => '3306',
    // 表前缀
    'prefix'      => 'mj_',
    // 主从
    'deploy'      => 0,
    // 分离
    'rw_separate' => false,
];
